package blair_2024.week_09;

public class Daily0226 {

    // 05-2 너비 우선 탐색 (BFS)

    /*

    ❗️너비 우선 탐색 (Breadth-first-search)
        - 그래프를 완전 탐색하는 방법 중 하나
        - 시작 노드에서 출발해 시작 노드를 기준으로 가까운 노드를 먼저 방문하면서 탐색하는 알고리즘
        - 선입선출 방식으로 탐색하므로 큐를 이용해 구현한다.
        - 탐색 시작 노드와 가까운 노드를 우선하여 탐색하므로 목표 노드에 도착하는 경로가 여러 개일때 최단 경로를 보장한다.

        - 너비 우선 탐색의 핵심 이론
            1. BFS를 시작할 노드를 정한 후 사용할 자료구조 초기화하기
            2. 큐에서 노드를 꺼낸 후 꺼낸 노드의 인접 노드를 다시 큐에 삽입하기
            3. 큐 자료구조에 값이 없을 때까지 반복하기

     */


}
