package blair_2024.week_10;

public class Daily0304 {

    /*

    ❗️데이터 모델링의 이해

        1. 모델링 특징 3가지
            - 추상화 (모형화, 가설적): 현실세계 일정한 형식에 맞추어 표현 (일정한 양식 표기법)
            - 단순화: 복잡한 현실세계 약속된 규역에 의해 제한된 표기법/언어로 쉽게 이해
            - 명확화: 누구나 이해하기 쉽게 대상의 애매모호함 제거. 정확하게 현상을 기술

        2. 모델링 관점 3가지
            - 데이터 관점: 업무와 데이터 or 데이터 간의 관계 / 구조분석
            - 프로세스 관점: 업무가 실제 하는 일 or 무엇을 해야하는지 / 업무 시나리오 분석
            - 상관 관점: 업무가 처리하는 일의 방법에 따라 데이터가 받는 영향 / crud 매트릭스

        3. 데이터 모델링 유의점 3가지
            - 중복: 데이터베이스가 여러 장소에 같으 정보 저장하는 것 주의
            - 비유연성: 사소한 업무 변화에 데이터모델이 수시로 변경되면 유지보수가 어려움
            - 비일관성: 데이터의 중복이 없어도 비일관성 발생 가능

        4. 데이터 모델링의 진행 3단계
            - 개념 (계획/분석): 추상화, 업무중심, 포괄, 전사적 ea 수립
            - 논리 (분석): 표현, 재사용성, 정규화
            - 물리 (설계): 데티어베이스 이식, 성능/저장 등 물리적 성격 고려

     */
}
